Strömungssimulation/elbowUnsteady/0/Co
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Co;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   nonuniform List<scalar> 
6943
(
0.0482534
0.0146503
0.0162219
0.0162574
0.0161188
0.0157852
0.0175153
0.0163163
...
)
;

boundaryField
{
    elbowWall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    injectorWall
    {
        type            zeroGradient;
    }
    injectorInlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
