Strömungssimulation/elbowUnsteady/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    elbowWall
    {
        type            noSlip;
    }
    injectorWall
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    injectorInlet
    {
	type		uniformFixedValue;
	uniformValue	
	{
		type	sine;
		amplitude	(0 2 0);	
		frequency	0.05;
		start		0;
		level		(0 1 0);
	}
    }
    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
